---
kind: type
id: T:Autodesk.Revit.DB.FilterStringGreaterOrEqual
source: html/43ce5f90-7e85-96b2-e9e6-18b493e9a22e.htm
---
# Autodesk.Revit.DB.FilterStringGreaterOrEqual

Tests whether string values from the document would sort after or match a certain string.

## Syntax (C#)
```csharp
public class FilterStringGreaterOrEqual : FilterStringRuleEvaluator
```

## Remarks
All string comparisons in this class are performed in the case-insensitive manner.